import pena from "../src/assets/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1.png"

const product = [
    {
        id:1,
        avatar:pena,
        title:"Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        price:2491,
        
    },
     {
        id:2,
        avatar:pena,
        title:"Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        price:3200,
        
    },
     {
        id:3,
        avatar:pena,
        title:"Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        price:1345,
        
    },
     {
        id:4,
        avatar:pena,
        title:"Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        price:2600,
        
    },
]