import React from 'react'
import pena from "../assets/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1.png"

export const Teplo = () => {

 
const products = [
    {
        id:1,
        avatar:pena,
        title:"Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        price:2491,
        
    },
     {
        id:2,
        avatar:pena,
        title:"Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        price:3200,
        
    },
     {
        id:3,
        avatar:pena,
        title:"Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        price:1345,
        
    },
     {
        id:4,
        avatar:pena,
        title:"Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        price:2600,
        
    },
]
  return (
    <div className='max-w-[1400px] m-auto'>
      <section className='max-w-[1400px] m-auto mt-[20px] flex items-center justify-between'>
          <h1 className='text-[50px]'>Теплоизоляция</h1>
            <button className='w-[250px] h-[50px] text-white bg-blue-600'>Смотреть все</button>

      </section>
      <section className='flex items-center justify-between'>
        <svg width="55" height="55" viewBox="0 0 55 55" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M15.9697 26.9697C15.6768 27.2626 15.6768 27.7374 15.9697 28.0303L20.7426 32.8033C21.0355 33.0962 21.5104 33.0962 21.8033 32.8033C22.0962 32.5104 22.0962 32.0355 21.8033 31.7426L17.5607 27.5L21.8033 23.2574C22.0962 22.9645 22.0962 22.4896 21.8033 22.1967C21.5104 21.9038 21.0355 21.9038 20.7426 22.1967L15.9697 26.9697ZM38.5 26.75L16.5 26.75L16.5 28.25L38.5 28.25L38.5 26.75Z" fill="#1E2126"/>
<rect x="0.5" y="0.5" width="54" height="54" stroke="#707070"/>
</svg>
<section>
    <div className='flex gap-[20px] items-center text-center mt-[50px] shadow-2xl p-[20px]'>
{products.map(item=>(
    <div    key={item.id}>
<img src={item.avatar} alt="" /><br />
<p>{item.title}</p><br />
<h3 className='text-[30px] text-blue-500'><b>{item.price} ₽/шт</b></h3><br /><br />
<section className='flex items-center justify-around'>
    <button className='w-[50px] h-[50px] border-1 border-gray-100 text-[18px]'>-</button>
    <button className='w-[50px] h-[50px] border-1 border-gray-100 text-[18px]'>1</button>
    <button className='w-[50px] h-[50px] border-1 border-gray-100 text-[18px]'>+</button>
    <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="50" height="50" fill="#1D6BDD"/>
<path d="M32.0529 31.1796C32.3774 31.1796 32.691 31.1219 32.9722 31.003C33.614 30.7253 34.043 30.2566 34.2413 29.6113C34.3531 29.2471 34.4541 28.883 34.555 28.5152C34.6055 28.3314 34.656 28.1475 34.71 27.9636L37.6088 17.764H17.8225L18.3597 19.9092H34.8254L33.9493 23.1396H19.0591L19.6684 25.2848H33.3652L32.3485 29.0344H18.4642L18.4246 28.9082C18.4137 28.8758 18.4065 28.8578 18.4029 28.8397L15.2662 16.174C15.1977 15.882 15.1292 15.6044 14.9922 15.352C14.6209 14.6742 14.0981 14.2524 13.3915 14.0721C13.3013 14.0505 13.2112 14.0361 13.1211 14.0216L12.984 14H9.94111C9.91587 14.0108 9.89424 14.0144 9.87621 14.018C9.64907 14.0505 9.4652 14.137 9.31017 14.2812C8.94242 14.6129 8.92439 15.2691 9.13711 15.6477C9.32459 15.9794 9.62023 16.138 10.0457 16.1416C10.6766 16.1452 11.3075 16.1452 11.9385 16.1416H12.9588L12.9985 16.2678C13.0093 16.3074 13.0165 16.3219 13.0201 16.3399L16.2217 29.276C16.2794 29.5211 16.337 29.7519 16.4488 29.9574C16.8851 30.7542 17.5485 31.1508 18.4714 31.1724C18.7599 31.1796 19.0519 31.176 19.3439 31.1724H19.8487V31.1832H30.3331L32.0529 31.1724V31.1796Z" fill="white"/>
<path d="M19.539 31.7384C18.3636 31.7384 17.4082 32.6938 17.4082 33.8692C17.4082 35.0445 18.3636 36 19.539 36C20.7143 36 21.6698 35.0445 21.6698 33.8692C21.6698 32.6938 20.7143 31.7384 19.539 31.7384Z" fill="white"/>
<path d="M31.5995 31.7384C30.4242 31.7384 29.4688 32.6938 29.4688 33.8692C29.4688 35.0445 30.4242 36 31.5995 36C32.7749 36 33.7303 35.0445 33.7303 33.8692C33.7303 32.6938 32.7749 31.7384 31.5995 31.7384Z" fill="white"/>
</svg>

</section>
    </div>
))}
    </div>
</section>
<svg width="55" height="55" viewBox="0 0 55 55" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect x="0.5" y="0.5" width="54" height="54" stroke="#707070"/>
<path d="M39.0303 26.9697C39.3232 27.2626 39.3232 27.7374 39.0303 28.0303L34.2574 32.8033C33.9645 33.0962 33.4896 33.0962 33.1967 32.8033C32.9038 32.5104 32.9038 32.0355 33.1967 31.7426L37.4393 27.5L33.1967 23.2574C32.9038 22.9645 32.9038 22.4896 33.1967 22.1967C33.4896 21.9038 33.9645 21.9038 34.2574 22.1967L39.0303 26.9697ZM16.5 26.75L38.5 26.75L38.5 28.25L16.5 28.25L16.5 26.75Z" fill="#1E2126"/>
</svg>

      </section>
      
    </div>
    
  )
}
